; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	infrared3 - mode
	thermograph2 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star12 - direction
	Star14 - direction
	GroundStation16 - direction
	Star17 - direction
	GroundStation18 - direction
	GroundStation9 - direction
	Star13 - direction
	Star19 - direction
	Star11 - direction
	Star6 - direction
	Star5 - direction
	GroundStation10 - direction
	Star0 - direction
	GroundStation7 - direction
	Star3 - direction
	Star15 - direction
	Star8 - direction
	Star20 - direction
	Star21 - direction
	Phenomenon22 - direction
	Star23 - direction
	Planet24 - direction
	Phenomenon25 - direction
	Planet26 - direction
	Planet27 - direction
	Star28 - direction
	Planet29 - direction
	Phenomenon30 - direction
	Planet31 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation18)
	(supports instrument1 infrared3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star19)
	(supports instrument2 thermograph2)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star15)
	(calibration_target instrument2 Star11)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star15)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star28)
)
(:goal (and
	(pointing satellite1 Planet26)
	(have_image Star20 infrared1)
	(have_image Star21 infrared1)
	(have_image Phenomenon22 infrared3)
	(have_image Star23 infrared1)
	(have_image Planet24 image0)
	(have_image Phenomenon25 image0)
	(have_image Planet26 thermograph2)
	(have_image Planet27 infrared3)
	(have_image Star28 infrared1)
	(have_image Planet29 thermograph2)
	(have_image Phenomenon30 infrared3)
	(have_image Planet31 thermograph2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (turn_to satellite0 phenomenon25 groundstation18)
   deleted: (pointing satellite0 groundstation18)
   added: (pointing satellite0 phenomenon25)
   goals met: 0 of 13
4. (turn_to satellite1 star6 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 star6)
   goals met: 0 of 13
5. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 13
6. (turn_to satellite1 phenomenon22 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon22)
   goals met: 0 of 13
7. (take_image satellite1 phenomenon22 instrument1 infrared3)
   added: (have_image phenomenon22 infrared3)
   goals met: 1 of 13
8. (turn_to satellite1 phenomenon30 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 phenomenon30)
   goals met: 1 of 13
9. (take_image satellite1 phenomenon30 instrument1 infrared3)
   added: (have_image phenomenon30 infrared3)
   goals met: 2 of 13
10. (turn_to satellite1 planet26 phenomenon30)
   deleted: (pointing satellite1 phenomenon30)
   added: (pointing satellite1 planet26)
   goals met: 3 of 13
11. (turn_to satellite1 planet27 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 planet27)
   goals met: 2 of 13
12. (take_image satellite1 planet27 instrument1 infrared3)
   added: (have_image planet27 infrared3)
   goals met: 3 of 13
13. (turn_to satellite1 planet26 planet27)
   deleted: (pointing satellite1 planet27)
   added: (pointing satellite1 planet26)
   goals met: 4 of 13
14. (turn_to satellite1 star20 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 star20)
   goals met: 3 of 13
15. (take_image satellite1 star20 instrument1 infrared1)
   added: (have_image star20 infrared1)
   goals met: 4 of 13
16. (turn_to satellite1 planet26 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 planet26)
   goals met: 5 of 13
17. (turn_to satellite1 star21 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 star21)
   goals met: 4 of 13
18. (take_image satellite1 star21 instrument1 infrared1)
   added: (have_image star21 infrared1)
   goals met: 5 of 13
19. (turn_to satellite1 planet26 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 planet26)
   goals met: 6 of 13
20. (turn_to satellite1 star23 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 star23)
   goals met: 5 of 13
21. (take_image satellite1 star23 instrument1 infrared1)
   added: (have_image star23 infrared1)
   goals met: 6 of 13
22. (turn_to satellite1 planet26 star23)
   deleted: (pointing satellite1 star23)
   added: (pointing satellite1 planet26)
   goals met: 7 of 13
23. (turn_to satellite1 star28 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 star28)
   goals met: 6 of 13
24. (take_image satellite1 star28 instrument1 infrared1)
   added: (have_image star28 infrared1)
   goals met: 7 of 13
25. (turn_to satellite1 planet26 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 planet26)
   goals met: 8 of 13
26. (turn_to satellite0 star8 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 star8)
   goals met: 8 of 13
27. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 8 of 13
28. (turn_to satellite0 phenomenon25 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon25)
   goals met: 8 of 13
29. (take_image satellite0 phenomenon25 instrument0 image0)
   added: (have_image phenomenon25 image0)
   goals met: 9 of 13
30. (turn_to satellite0 planet24 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 planet24)
   goals met: 9 of 13
31. (take_image satellite0 planet24 instrument0 image0)
   added: (have_image planet24 image0)
   goals met: 10 of 13
32. (turn_to satellite0 planet26 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet26)
   goals met: 10 of 13
33. (take_image satellite0 planet26 instrument0 thermograph2)
   added: (have_image planet26 thermograph2)
   goals met: 11 of 13
34. (turn_to satellite0 planet29 planet26)
   deleted: (pointing satellite0 planet26)
   added: (pointing satellite0 planet29)
   goals met: 11 of 13
35. (take_image satellite0 planet29 instrument0 thermograph2)
   added: (have_image planet29 thermograph2)
   goals met: 12 of 13
36. (turn_to satellite0 planet31 planet29)
   deleted: (pointing satellite0 planet29)
   added: (pointing satellite0 planet31)
   goals met: 12 of 13
37. (take_image satellite0 planet31 instrument0 thermograph2)
   added: (have_image planet31 thermograph2)
   goals met: 13 of 13
